import { Link } from "react-router-dom"
import { Button } from "../UI/Button"


export const MainLearnMore = () => {
    return (
        <section className="wrap flex flex-col items-center py-10">
            <div className="mb-5">
                <svg width="200" height="200" viewBox="0 0 200 200" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <rect width="200" height="200" rx="100" fill="#262626"/>
                    <rect x="72" y="72" width="55" height="55" rx="27.5" fill="#191919"/>
                    <path d="M102.752 99.168L99.555 97.036C99.4043 96.9354 99.229 96.8777 99.048 96.869C98.867 96.8603 98.687 96.901 98.5274 96.9866C98.3677 97.0723 98.2342 97.1997 98.1414 97.3553C98.0485 97.5109 97.9996 97.6888 98 97.87V102.133C98 102.314 98.0491 102.492 98.1421 102.647C98.2352 102.802 98.3686 102.929 98.5282 103.015C98.6879 103.1 98.8677 103.141 99.0485 103.132C99.2293 103.123 99.4044 103.065 99.555 102.965L102.752 100.833C102.889 100.742 103.001 100.618 103.079 100.473C103.157 100.328 103.197 100.166 103.197 100.001C103.197 99.8364 103.157 99.6743 103.079 99.5292C103.001 99.3841 102.889 99.2603 102.752 99.169V99.168Z" stroke="#FFE800" strokeWidth="2" strokeLinecap="round" strokeLinejoin="round"/>
                    <path d="M109 100C109 101.182 108.767 102.352 108.315 103.444C107.863 104.536 107.2 105.528 106.364 106.364C105.528 107.2 104.536 107.863 103.444 108.315C102.352 108.767 101.182 109 100 109C98.8181 109 97.6478 108.767 96.5558 108.315C95.4639 107.863 94.4718 107.2 93.636 106.364C92.8003 105.528 92.1374 104.536 91.6851 103.444C91.2328 102.352 91 101.182 91 100C91 97.6131 91.9482 95.3239 93.636 93.636C95.3239 91.9482 97.6131 91 100 91C102.387 91 104.676 91.9482 106.364 93.636C108.052 95.3239 109 97.6131 109 100Z" stroke="#FFE800" strokeWidth="2" strokeLinecap="round" strokeLinejoin="round"/>
                </svg>
            </div>
            <div className="space-y-5">
                <h1 className="h1 text-center">Играй, развивайся&nbsp;и зарабатывай вместе&nbsp;с&nbsp;GoodGames!</h1>
                <p className="p mx-auto max-w-[284px] text-center">
                    Поcоревнуйся с&nbsp;лучшими игроками в&nbsp;широкоформатных турнирах, мини-турнирах и&nbsp;практических играх. Врывайся в&nbsp;топ рейтинга и получай крупные призы.
                </p>
                <div className="flex justify-evenly">
                    <Link>
                        <Button white={true} text="Зарегистрироваться"></Button>
                    </Link>
                    <Link>
                        <Button text="Обучение"></Button>
                    </Link>
                </div>
            </div>
        </section>
    )
}