import logopic from "../assets/Main/logo.png";
import { Link } from "react-router-dom";

export const TermsOfUse = () => {
    return (
        <section className="bg-darkgrey min-h-[100vh]">
            <Link
                className="w-full flex items-center justify-center fixed top-0 bg-darkgrey pt-12 pb-3 z-50"
                to="/"
            >
                <img src={logopic} alt="logopic" className="w-[132px]" />
            </Link>
            <main className="wrap pt-28 text-white pb-20 space-y-3">
                <h1 className="h1 text-center uppercase">Пользовательское соглашение</h1>
                <div className="text-sm text-end bg-grey/20 p-2 rounded-lg">
                    <p>Утверждаю: &laquo;18&raquo; декабря 2022 года</p>
                    <p>Индивидуальный&nbsp;предприниматель Букланс&nbsp;Владислав&nbsp;Дмитриевич</p>
                    <p>ИНН 434583955600</p>
                    <p>ОГРНИП 317435000033787</p>
                </div>
                <div className="space-y-3">
                    <p>Настоящее Пользовательское соглашение (Далее&nbsp;&mdash; &laquo;Соглашение&raquo;) регулирует отношения между администрацией Сайта/Приложения GoodGames (Далее&nbsp;&mdash; &laquo;Сервис&raquo;), именуемой далее&nbsp;&mdash; &laquo;Администрация&raquo;, и&nbsp;любым лицом, посещающим (пользующимся) Сайт (Приложением), именуемым далее&nbsp;&mdash; &laquo;Пользователь&raquo;.</p>
                    <p>Настоящее Соглашение представляет собой официальное предложение в&nbsp;адрес физических лиц (Пользователей), которые принимают настоящее Соглашение, в&nbsp;отношении пользования Сервисом и&nbsp;размещения Пользователями Информации, на&nbsp;условиях настоящего Соглашения.</p>
                    <p>Администрация и&nbsp;Пользователь совместно именуются&nbsp;&mdash; &laquo;Стороны&raquo;, а&nbsp;по&nbsp;отдельности&nbsp;&mdash; &laquo;Сторона&raquo;.</p>
                    <p>Настоящее Соглашение в&nbsp;соответствии со&nbsp;статьей 438 Гражданского кодекса&nbsp;РФ является договором присоединения (далее по&nbsp;тексту&nbsp;&mdash; Договор), адресованный любым лицам и&nbsp;может быть принято лицом не&nbsp;иначе как путем присоединения к&nbsp;Соглашению в&nbsp;целом.</p>
                    <p>Настоящее Соглашение считается заключенным и&nbsp;приобретает силу договора присоединения с&nbsp;момента совершения лицом действий по&nbsp;заведению учетной записи (аккаунта) и&nbsp;завершения этапа регистрации путем нажатия кнопки &laquo;зарегистрироваться&raquo; и&nbsp;означает полное и&nbsp;безоговорочное принятие лицом всех условий настоящего Соглашения без каких-либо изъятий и/или ограничений.</p>
                    <p>Настоящее Соглашение считается заключенным и&nbsp;приобретает силу договора присоединения с&nbsp;момента совершения лицом действий по&nbsp;заведению учетной записи (аккаунта) и&nbsp;завершения этапа регистрации путем нажатия кнопки &laquo;зарегистрироваться&raquo; и&nbsp;означает полное и&nbsp;безоговорочное принятие лицом всех условий настоящего Соглашения без каких-либо изъятий и/или ограничений.</p>
                    
                    <div className="space-y-3">
                        <h3 className="h3 text-center">1.	ТЕРМИНЫ И&nbsp;ОПРЕДЕЛЕНИЯ:</h3>
                        <p>Пользовательское соглашение&nbsp;&mdash; текст, опубликованный на&nbsp;Сайте, а&nbsp;также в&nbsp;Приложении в&nbsp;разделе &laquo;Настройки&raquo;, предоставляющий информацию о&nbsp;правилах использования Пользователем Сервиса.</p>
                        <p>Приложение&nbsp;&mdash; программное приложение для Устройств, являющееся интеллектуальной собственностью Администрации, предоставляющее Пользователю возможность использования сервиса GoodGames.</p>
                        <p>Устройство&nbsp;&mdash; электронное устройство Пользователя, подключенное к&nbsp;сети Интернет, работающее на&nbsp;базе операционных систем iOS или Android, дающее Пользователю возможность пользования Сервисом GoodGames посредством Сайта или Приложения.</p>
                        <p>Пользователь&nbsp;&mdash; любое физическое лицо, достигшее возраста 18&nbsp;лет, принявшее условия настоящего Соглашения и&nbsp;осуществляющее доступ к&nbsp;Сервису посредством сети Интернет.</p>
                        <p>Администрация&nbsp;&mdash; владелец Сайта, Приложения, осуществляющий управление Сайтом, Приложением и&nbsp;взаимодействующий с&nbsp;Пользователями, а&nbsp;также совершающий иные действия, связанных с&nbsp;использованием Сервиса.</p>
                        <p>Учетная запись (аккаунт)&nbsp;&mdash; запись, хранящаяся на&nbsp;Сайте/в Приложении, содержащая сведения, необходимые для идентификации Пользователя при предоставлении доступа к&nbsp;Сайту/Приложению, информацию для Авторизации и&nbsp;учета в&nbsp;Приложении. К&nbsp;такой записи, в&nbsp;том числе относится адрес электронной почты.</p>
                        <p>Личный кабинет&nbsp;&mdash; совокупность защищенных страниц Сайта/Приложения, созданных в&nbsp;результате регистрации и&nbsp;доступных ему при условии ввода логина и&nbsp;пароля.</p>
                        <p>Подписка&nbsp;&mdash; это плата за&nbsp;комплекс услуг и&nbsp;информационное сопровождение.</p>
                        <p>Подписка&nbsp;&mdash; это плата за&nbsp;комплекс услуг и&nbsp;информационное сопровождение.</p>
                        <p>Безакцептное списание&nbsp;&mdash; списание денежных средств с&nbsp;банковской карты, указанной Пользователем во&nbsp;исполнение условий настоящего Договора. Списание денежных средств производится без получения дополнительного согласия со&nbsp;стороны Пользователя, по&nbsp;правилам и&nbsp;в&nbsp;порядке, предусмотренными законодательством&nbsp;РФ и&nbsp;настоящим Соглашением.</p>
                    </div>
                    <div className="space-y-3">
                        <h3 className="h3 text-center">2.	ОБЩИЕ ПОЛОЖЕНИЯ</h3>
                        <p>2.1.	Предметом Соглашения является порядок использования Сервиса, создания в&nbsp;нем учетной записи, осуществления Пользователем Подписки, а&nbsp;также отказа от&nbsp;использования Сервиса.</p>
                    </div>
                    <div className="space-y-3">
                        <h3 className="h3 text-center">3.	РЕГИСТРАЦИЯ, БЕЗОПАСНОСТЬ УЧЕТНОЙ ЗАПИСИ.</h3>
                        <ul>
                            3.1.	Регистрация Пользователя в&nbsp;Сервисе осуществляется путем заполнения соответствующей регистрационной формы. При регистрации Пользователь вводит в&nbsp;форму обратной связи:
                            <li>1)	Имя;</li>
                            <li>2)	Адрес электронной почты;</li>
                            <li>3)	Аккаунт в социальных сетях.</li>
                            после этого необходимо нажать на&nbsp;кнопку &laquo;зарегистрироваться&raquo;.
                        </ul>
                        <p>3.2.	Пользователь обязуется отразить в&nbsp;регистрационной форме достоверную, полную и&nbsp;точную информацию о&nbsp;себе и&nbsp;поддерживать эту информацию в&nbsp;актуальном состоянии.</p>
                        <p>3.3.	Пользователь согласен с&nbsp;тем, что он&nbsp;самостоятельно несет ответственность за&nbsp;сохранение конфиденциальности логина и&nbsp;пароля, связанных с&nbsp;его личным аккаунтом, используемым им&nbsp;для доступа к&nbsp;Сервису. Также Пользователь согласен с&nbsp;тем, что он&nbsp;несет исключительную ответственность перед Администрацией за&nbsp;все действия, которые совершены при использовании его (Пользователя) аккаунта.</p>
                        <p>3.4.	В&nbsp;случае, если Пользователю станет известно о&nbsp;любом несанкционированном использовании его пароля, логина или реквизитов личного аккаунта, Пользователь обязуется незамедлительно уведомить об&nbsp;этом Администрации, направив соответствующее электронное сообщение по&nbsp;адресу: fontevitae@mail.ru</p>
                        <p>3.5.	Пользователь обязуется не&nbsp;размещать (а&nbsp;в&nbsp;случае размещения&nbsp;&mdash; самостоятельно нести ответственность в&nbsp;полном объеме) в&nbsp;Приложении личную информацию других Пользователей или любых третьих лиц без их&nbsp;личного согласия на&nbsp;такие действия.</p>
                    </div>
                    <div className="space-y-3">
                        <h3 className="h3">4.	РАЗМЕР, ПОРЯДОК И ФОРМА ОПЛАТЫ</h3>
                        <p>4.1.	Осуществление платежей, предусмотренных настоящим Соглашением, производится посредством подписки&nbsp;&mdash; безакцептного списания денежных средств с&nbsp;банковской карты Пользователя в&nbsp;соответствии с&nbsp;выбранным Пользователем тарифом.</p>
                        <p>4.2.	Виды тарифов:</p>
                        <p>4.3.	При присоединении к&nbsp;настоящему Соглашению Пользователь выражает свое безоговорочное согласие на&nbsp;отправление Администрацией поручений, запросов, требований Банку Пользователя, а&nbsp;также на&nbsp;безакцептное списание денежных средств, составляющих платежи, предусмотренные настоящим Соглашением.</p>
                        <p>4.4.	Услуги Администрации не&nbsp;облагаются НДС в&nbsp;связи с&nbsp;применением Администрацией упрощенной системы налогообложения.</p>
                        <p>4.5.	В&nbsp;случае досрочного расторжения Соглашения по&nbsp;инициативе Пользователя денежные средства не&nbsp;возвращаются.</p>
                        <p>4.6.	При отсутствии вины Пользователя в&nbsp;нарушении условий настоящего Соглашения Администрация в&nbsp;течение 7&nbsp;календарных дней с&nbsp;даты направления Пользователь Претензии на&nbsp;почту fontevitae@mail.ru производит возврат ошибочно списанных денежных средств.</p>
                    </div>
                    <div className="space-y-3">
                        <h3 className="h3">5.	ПРАВА И ОБЯЗАННОСТИ СТОРОН</h3>
                        <ul>5.1.	Права и&nbsp;обязанности Администрации:
                            <li>5.1.1.	Администрация обязуется предоставить Пользователю возможность круглосуточного доступа к&nbsp;Сервису, а&nbsp;также к&nbsp;аккаунту последнего.</li>
                            <li>5.1.2.	Администрация обязуется своевременно размещать информацию об&nbsp;изменении условий настоящего Соглашения.</li>
                            <li>5.1.3.	Администрация вправе заблокировать аккаунт Пользователя в&nbsp;случае нарушения им&nbsp;правил настоящего Пользовательского соглашения.</li>
                            <li>5.1.4.	Администрация вправе приостановить использование Сервиса в&nbsp;связи с&nbsp;производственной необходимостью либо в&nbsp;связи с&nbsp;проведением профилактических работ, а&nbsp;также в&nbsp;случаях, установленных законодательством&nbsp;РФ.</li>
                            <li>5.1.5.	Администрация вправе отказать в&nbsp;заключении Соглашения в&nbsp;случае предоставления Пользователем недостоверных или не&nbsp;полных данных.</li>
                            <li>5.1.6.	В&nbsp;случае наличия у&nbsp;Администрации достаточных оснований полагать о&nbsp;возможности совершения Пользователем мошеннических действий, а&nbsp;также иных проявлениях недобросовестного поведения, в&nbsp;одностороннем порядке прекратить исполнение по&nbsp;данному Соглашению без предварительного уведомления Пользователя.</li>
                        </ul>
                        <ul>5.2.	Права и&nbsp;обязанности Пользователя:
                            <li>5.2.1.	Пользователь обязуется соблюдать правила настоящего Пользовательского соглашения.</li>
                            <li>5.2.2.	Пользователь обязуется предоставлять достоверную Информацию о&nbsp;себе в&nbsp;процессе создания учетной записи (аккаунта).</li>
                            <li>5.2.3.	Пользователь обязуется не&nbsp;воспроизводить, не&nbsp;повторять и&nbsp;не&nbsp;копировать, не&nbsp;продавать и&nbsp;не&nbsp;перепродавать, а&nbsp;также не&nbsp;использовать для каких-либо коммерческих целей какие-либо части Сервиса.</li>
                            <li>5.2.4.	Пользователь обязуется соблюдать положения действующего законодательства Российской Федерации, настоящего Соглашения и&nbsp;иных специальных документов Администрации. В&nbsp;случае наличия сомнений в&nbsp;отношении законности осуществления тех или иных действий, в&nbsp;том числе по&nbsp;размещению информации или предоставлению доступа, Администрация рекомендует воздержаться от&nbsp;осуществления последних.</li>
                            <li>5.2.5.	Пользователь обязуется в&nbsp;случае списания денежных средств со&nbsp;счета Пользователя в&nbsp;большем/меньшем размере незамедлительно уведомить об&nbsp;этом Администрацию по&nbsp;электронной почте: fontevitae@mail.ru</li>
                            <li>5.2.6.	Пользователь вправе прекратить пользоваться Сервисом в&nbsp;любой момент. Пользователь вправе в&nbsp;любой момент удалить свою учетную запись через личный кабинет без возможности восстановления.</li>
                        </ul>
                        <ul>5.3.	Пользователю запрещается:
                            <li>5.3.1.	вводить Пользователей в&nbsp;заблуждение относительно своей личности, используя логин и&nbsp;пароль другого зарегистрированного Пользователя;</li>
                            <li>5.3.2.	загружать, хранить, публиковать, распространять и&nbsp;предоставлять доступ или иным образом использовать любую информацию, которая:
                                <ul>
                                    <li>(а) содержит угрозы, призывы к&nbsp;насилию, в&nbsp;том числе скрытые, одобрение и&nbsp;поощрение насильственных действий, дискредитирует, оскорбляет, порочит честь и&nbsp;достоинство или деловую репутацию или нарушает неприкосновенность частной жизни других Пользователей или третьих лиц;</li>
                                    <li>(б) нарушает права несовершеннолетних лиц;</li>
                                    <li>(в) является вульгарной или непристойной, содержит порнографические изображения и&nbsp;тексты или сцены сексуального характера с&nbsp;участием несовершеннолетних;</li>
                                    <li>(г) содержит сцены бесчеловечного обращения с&nbsp;животными;</li>
                                    <li>(д) содержит описание средств и&nbsp;способов суицида, любое подстрекательство к&nbsp;его совершению;</li>
                                    <li>(е) пропагандирует и/или способствует разжиганию расовой, религиозной, этнической ненависти или вражды, по&nbsp;признакам отнесения к&nbsp;определенным полу, ориентации, а&nbsp;также по&nbsp;иным индивидуальным признакам и&nbsp;особенностям человека (включая вопросы его здоровья);</li>
                                    <li>(ж) содержит экстремистские материалы;</li>
                                    <li>(з) пропагандирует преступную деятельность или содержит советы, инструкции или руководства по&nbsp;совершению преступных действий;</li>
                                    <li>(и) содержит информацию ограниченного доступа, включая, но&nbsp;не&nbsp;ограничиваясь, государственной и&nbsp;коммерческой тайной, информацией о&nbsp;частной жизни третьих лиц;</li>
                                    <li>(к) содержит рекламу или описывает привлекательность употребления наркотических веществ, в&nbsp;том числе &laquo;цифровых наркотиков&raquo; (звуковых файлов, оказывающих воздействие на&nbsp;мозг человека за&nbsp;счет бинауральных ритмов), информацию о&nbsp;распространении наркотиков, рецепты их&nbsp;изготовления и&nbsp;советы по&nbsp;употреблению;</li>
                                    <li>(л) потенциально может привести к&nbsp;совершению противоправных действий путем введения Пользователей в&nbsp;заблуждение или злоупотребления их&nbsp;доверием;</li>
                                    <li>(м) а&nbsp;также нарушает иные права и&nbsp;интересы граждан и&nbsp;юридических лиц или требования законодательства Российской Федерации.</li>
                                </ul>
                            </li>
                            <li>5.3.3.	незаконно загружать, хранить, публиковать, распространять и&nbsp;предоставлять доступ или иным образом использовать интеллектуальную собственность Пользователей и&nbsp;третьих лиц;</li>
                            <li>5.3.4.	использовать программное обеспечение и&nbsp;осуществлять действия, направленные на&nbsp;нарушение нормального функционирования Сервиса или персональных страниц Пользователей;</li>
                            <li>5.3.5.	любым способом, в&nbsp;том числе, но&nbsp;не&nbsp;ограничиваясь, путем обмана, злоупотребления доверием, взлома, пытаться получить доступ к&nbsp;логину и&nbsp;паролю другого Пользователя;</li>
                            <li>5.3.6.	осуществлять незаконные сбор и&nbsp;обработку персональных данных других лиц;</li>
                            <li>5.3.7.	осуществлять использование Сервиса иным способом, кроме как через интерфейс, предоставленный Администрацией, за&nbsp;исключением случаев.</li>
                        </ul>
                    </div>
                    <div className="space-y-3">
                        <h3 className="h3 text-center">6.	ПРАВА НА ИНТЕЛЛЕКТУАЛЬНУЮ СОБСТВЕННОСТЬ</h3>
                        <p>6.1.	Предоставляемые Пользователю результаты интеллектуальной деятельности в&nbsp;процессе получения услуги в&nbsp;цифровой форме впоследствии могут использоваться Пользователем для личной деятельности. Пользователю разрешается на&nbsp;правах неисключительной лицензии использовать полученные результаты интеллектуальной деятельности. Запрещается любая переработка, запись, копирование результатов интеллектуальной деятельности, а&nbsp;также частей, доступ к&nbsp;которым получил Пользователь.</p>
                        <p>6.2.	Пользователь обязуется обеспечить конфиденциальность всех сведений, полученных от&nbsp;Администрации в&nbsp;процессе использования Сервиса.</p>
                        <p>6.3.	Нарушение авторских прав и&nbsp;прав интеллектуальной собственности влечет гражданско-правовую, административно-правовую и&nbsp;уголовную ответственность.</p>
                        <p>6.4.	Использование Пользователем интеллектуальной собственности влечет взыскание штрафа в&nbsp;соответствии с&nbsp;действующим законодательством.</p>
                    </div>
                    <div className="space-y-3">
                        <h3 className="h3 text-center">7.	ОТВЕТСТВЕННОСТЬ СТОРОН</h3>
                        <p>7.1.	Недостоверное предоставление Пользователем сведений, в&nbsp;том числе неполное предоставление Пользователем сведений освобождает Администрацию от&nbsp;ответственности перед Пользователями.</p>
                        <p>7.2.	Администрация не&nbsp;несет ответственности в&nbsp;случае получения несанкционированного доступа к&nbsp;Сервису третьими лицами, а&nbsp;также в&nbsp;случае передачи Пользователем логина и&nbsp;пароля третьим лицам, а&nbsp;также за&nbsp;блокировку аккаунта пользователя по&nbsp;не&nbsp;зависящим от&nbsp;Администрации причинам.</p>
                        <p>7.3.	Администрация не&nbsp;несет ответственности за&nbsp;несоответствие Сервиса ожиданиям Пользователя и/или за&nbsp;его субъективную оценку.</p>
                        <p>7.4.	Администрация освобождается от&nbsp;ответственности за&nbsp;полное или частичное неисполнение обязательств, предусмотренных настоящим Договором, если это неисполнение явилось следствием обстоятельств непреодолимой силы, возникших после заключения договора, в&nbsp;результате событий чрезвычайного характера, которые Стороны не&nbsp;могли ни&nbsp;предвидеть, ни&nbsp;предотвратить разумными мерами (форс-мажор).</p>
                        <p>7.5.	Пользователь обязуется предоставлять достоверные данные. Администрация не&nbsp;проверяет соответствие предоставленных данных действительности и&nbsp;предполагает, что все сведения, которые сообщил о&nbsp;себе Пользователь, является достоверной информацией.</p>
                        <p>7.6.	Администрация прилагает все разумные усилия, предотвращающие сбои и&nbsp;неполадки в&nbsp;работе Сервиса, однако не&nbsp;гарантирует его бесперебойную работу, не&nbsp;несет ответственности за&nbsp;нее и&nbsp;не&nbsp;обязуется уведомлять Пользователя о&nbsp;перебоях.</p>
                    </div>
                    <div className="space-y-3">
                        <h3 className="h3">8.	РАЗРЕШЕНИЕ СПОРОВ</h3>
                        <p>8.1.	Все споры и&nbsp;разногласия, возникшие в&nbsp;связи с&nbsp;исполнением договора решаются Сторонами путем переговоров.</p>
                        <p>8.2.	Досудебный порядок урегулирования споров&nbsp;&mdash; 30&nbsp;дней, с&nbsp;момента поступления претензии Администратору в&nbsp;письменной форме или электронной форме, которая позволяет индивидуализировать личность Пользователя.</p>
                        <p>8.3.	В&nbsp;случае недостижения согласия между Сторонами все споры рассматриваются в&nbsp;судебном порядке в&nbsp;соответствии с&nbsp;законодательством&nbsp;РФ.</p>
                    </div>
                    <div className="space-y-3">
                        <h3 className="h3">9.	СРОК СОГЛАШЕНИЯ</h3>
                        <p>9.1.	Срок подписки устанавливается в&nbsp;30 (тридцать) календарных дней.</p>
                        <p>9.2.	Соглашение может быть автоматически пролонгировано путем безакцептного списания денежных средств с&nbsp;банковской карты Пользователя на&nbsp;срок&nbsp;30 (тридцать) календарных дней.</p>
                        <p>9.3.	Пользователь имеет право расторгнуть Соглашение в&nbsp;одностороннем порядке в&nbsp;разделе Сервиса &laquo;Подписки&raquo; путем отмены подписки.</p>
                        <p>9.4.	При отсутствии возможности списания денежных средств с&nbsp;банковской карты Пользователя в&nbsp;счет платежей Администрация вправе расторгнуть Соглашение в&nbsp;одностороннем порядке.</p>
                    </div>
                    <div className="space-y-3">
                        <h3 className="h3">10.	ПРОЧИЕ УСЛОВИЯ</h3>
                        <p>10.1.	Настоящее Соглашение вступает в&nbsp;силу с&nbsp;момента регистрации Пользователем и&nbsp;действует до&nbsp;момента исполнения Сторонами всех обязательств.</p>
                        <p>10.2.	Совершая регистрацию, Пользователь подтверждает, что все условия настоящего Соглашения ему ясны, и&nbsp;он&nbsp;принимает их&nbsp;безусловно и&nbsp;в&nbsp;полном объеме.</p>
                        <p>10.3.	Администратор имеет право вносить изменение в&nbsp;настоящее Соглашение. Изменения вступают в&nbsp;силу с&nbsp;момента их&nbsp;утверждения и&nbsp;размещения в&nbsp;соответствующем разделе Сервиса.</p>
                    </div>
                </div>
            </main>
        </section>
    )
}